In [2]:
import numpy as np
import pandas as pd

In [4]:
series_1 = pd.Series([1, 2, 3, 4, 5, np.nan, 5, 7])
series_1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    5.0
7    7.0
dtype: float64

In [6]:
dates = pd.date_range("2013-01-01", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
pd.Series(1, index=list(range(4)), dtype="float32")

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float32

In [11]:
np.array([3] * 4, dtype="int32")

array([3, 3, 3, 3], dtype=int32)

In [37]:
np.random.randint(1, 10, size = 4)

array([9, 5, 6, 1])

In [38]:
data_dict = {
    "A" : 1.0,
    "B" : pd.Timestamp("2013-01-02"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.random.randint(1, 10, size = 4),
    "E" : pd.Categorical(["test", "train", "test", "train"]),
    "F" : "foo"
}
df2 = pd.DataFrame(data_dict)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [39]:
pd.Series(1, dtype="float32")

0    1.0
dtype: float32

In [40]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int64
E         category
F           object
dtype: object

In [41]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [42]:
df2.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [43]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [44]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [45]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 4, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 7, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [46]:
df2.describe()

         A                    B    C         D
count  4.0                    4  4.0  4.000000
mean   1.0  2013-01-02 00:00:00  1.0  4.250000
min    1.0  2013-01-02 00:00:00  1.0  3.000000
25%    1.0  2013-01-02 00:00:00  1.0  3.000000
50%    1.0  2013-01-02 00:00:00  1.0  3.500000
75%    1.0  2013-01-02 00:00:00  1.0  4.750000
max    1.0  2013-01-02 00:00:00  1.0  7.000000
std    0.0                  NaN  0.0  1.892969

In [47]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [48]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,4,3,7,3
E,test,train,test,train
F,foo,foo,foo,foo

In [49]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [50]:
a = df2.sort_index(axis=1, ascending=True)
a

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [53]:
df2.sort_values(by="D", ascending = False)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  7   test  foo
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [54]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  4   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## Selection and Indexing and Slicing

In [55]:
df2["A"]

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [58]:
df2[1:3]

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  7   test  foo

In [60]:
df2.loc[:, ["B", "D"]]

           B  D
0 2013-01-02  4
1 2013-01-02  3
2 2013-01-02  7
3 2013-01-02  3

In [61]:
df2.iloc[0:2, 0:2]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

## Boolean Indexing

In [63]:
df2[df2["D"] > 3]

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  4  test  foo
2  1.0 2013-01-02  1.0  7  test  foo